let 速度=60;
let t={
"开始":["夜路归途","夜深人静的街巷，路上没有其他行人，空气中弥漫着一股焦味，远处山峦的影子看上去像一头饥饿的巨兽，你感觉周遭有什么在躁动不安着。"],
"结局":["结局","你成功回到了家，刚才经历的一切仿佛是一场梦。"],
"血月1":["血月","你抬头望向天空，月逐渐变得赤红，降下的雨也如同鲜血。"],
"血月2":["月蚀","你抬头望向天空，赤红的月像被吞噬一般，消失不见。"],
"血月3":["神<ruby><rb>将</rb><rt>jiāng</rt></ruby>醒","你听到哀嚎声，有黑暗在吞噬这个世界。"],
"血月4":["世界末日？","恍惚间，你仿佛见证了整个世界的毁灭，又好像只是你的错觉。"],
};
let d=[
/*
["标题","显示内容"],
["特殊","id"],
["选项","标题","显示文字",[["选项1","标题1","内容1"],["选项2","标题2","内容2"],["选项3","标题3","内容3"],["选项4","标题4","内容4"]],"结局"],
↑ 如果有结局，在所有都选完，再遇到时显示结局；如果是""，选完就没了
↑ 结局后面的位置留给代码，如有则代表不是第一次遇到
["进展",["标题","第一次遇到"],["标题","第二次遇到"]],
*/

// ["",""],
// ["特殊",""],
// ["进展",["",""],["",""]],
// ["选项","","",[["","",""],["","",""]],"结局"],

["进展",["两个小孩","路边有两个小孩在玩耍，一个是男孩，手上缠着铃铛叮铃作响；另一个是女孩，头上戴着一朵桃花。{<br>}你正想继续赶路，又觉得天色已晚，打算出言提醒他们早点回家，一回头两个小孩已经不见踪影。"],["两棵小树","路边有两棵树，一棵的树枝上缠着铃铛叮铃作响，另一棵树上开着一朵桃花。"]],
["井绳","你看到一口井，正好口渴，你降下水桶，盛了些水，握着井绳向上拉，却感觉绳子握在手里滑溜溜的，更像女人的头发。{<br>}往下看，黑色井绳连着的居然是一个人头。{<br>}你吓得松开手，井底传来扑通一声。{<br>}低头望去，只有一个木桶漂浮着。"],
["孤影","你隐约察觉到影子走的比你还快，你惊异的停下脚步，影子竟然脱离了你，自顾自的前进着。{<br>}你没敢跟上去，换了条路。"],
["进展",["歇脚","你坐在树下歇脚，忽然惊闻一声「小心！」，你这才注意到身旁一条毒蛇正悄无声息的向你逼近，你赶忙起身远离了这里。{<br>}你向四周望去，并无其他人，不知道是谁好心提醒了你一句。"],["镜子","你看见路边摆着一面镜子，映照出的却不是你，而是有人正坐在树下歇脚，你感觉很新奇，仔细一看，发现那人身旁一条毒蛇正悄无声息的逼近。{<br>}「小心！」{<br>}你下意识的出口提醒，镜子忽然碎裂，不知道你的提醒有没有帮到那个人。"]],
["特殊","涂壁"],
["烟赌坊","途径一间赌坊，里面人声鼎沸，热闹非凡。人们叫嚷着下注，吞云吐雾，整间赌坊都笼在一片迷蒙之中。{<br>}恍惚间你竟生出玩一局试试的念头。{<br>}忽然一阵冷风吹过，你清醒过来。{<br>}哪有什么赌坊，面前只有一片焚烧过的废墟。"],
["破庙","一间破破烂烂的小庙，看不出有人居住的痕迹，你隐约感觉到里面有什么不好的东西。"],
["杀生石","你捡到一块不断散发毒气的石头，在中毒之前赶紧扔到了一边。"],
["神便鬼毒酒","你闻到一股好闻的酒味，一切魑魅魍魉都暂时远离了你。"],
["一目五先生","五个可疑的人悄悄跟在你的身后，不知道是不是错觉，有四个人没有眼睛，你赶紧加快了脚步。"],
["雨女","忽然下起大雨，你隐约看到前方有一女子在淋雨，楚楚可怜。{<br>}你不知怎么回事，忍不住走上前去，忽然一阵风刮过，女子不见了踪影，雨也停了。"],
["月亮雨","忽然下起雨来，你抬头望去，月亮依然挂在天上，没有一朵乌云。{<br>}这雨是从何而来？"],
["百鬼夜行","空无一人的街道忽然喧嚣起来，奇形怪状的妖怪们在街上游走，热闹非凡。{<br>}你屏住呼吸混入其中，找机会躲了起来，好在没有被发现。"],
["蚕马","一棵树上挂着许多蚕茧，其中一个竟与人等高，暗褐色的茧壳布满不规则的褶皱，看上去更像是兽皮被包裹成蚕茧状。"],
["妒妇津","前面的路被一条河流拦住，石碑写着此处名为“妒妇津”，曾有一女子因妒忌而自溺与此，并警告女子不可在此处过河。{<br>}你见河流并不湍急，借用岸边的渡船，泛舟渡河。{<br>}并没有发生什么，你顺利的到达了对岸。"],
["发鬼","你遇到一名女子，她的皮肤光滑白皙，身体被乌黑的长发包裹。{<br>}她抬头看了你一眼，你从她的眼神中看出了贪婪，你赶紧逃离了这里。"],
["负尸","你走着走着，忽然感觉背后一沉，回头望去，竟是一具死尸搭在背上。{<br>}你正想将其甩开，死尸忽然不见了。"],
["滑瓢","一个光头的老人悄悄跟着你，毫不隐蔽，闲庭信步的就像在自家院子里散步。{<br>}「前面有一酒席，要不要同我一起去喝一杯？」{<br>}说着他还做出喝酒的手势。{<br>}你想到还要赶路，拒绝了他。"],
["画壁","你见到一幅天女散花壁画，画中的仙女活灵活现，栩栩如生。{<br>}你驻足观赏，仿佛进入画中与仙女作乐，好一会儿才回过神。"],
["巨手","一只土石构成的巨手从地下钻出，抢走了你的包裹。"],
["庙鬼","一个简陋的小庙，里面有和尚诵经的声音，正好可以在这里借住一宿。{<br>}你去敲了敲门，一个小沙弥开了门，你表明来意，对方为你准备了住处。{<br>}没睡多久，你被一阵冷风冻醒，睁开眼发现你躺在荒郊野岭。"],
["人面果","路边的树上结着许多果子，一颗刚好落在你的脚下，你低头看去，果子上竟然长着一张人脸。"],
["选项","伯奇","树上有只小鸟在独自鸣唱。",[["驻足聆听","伯奇","它的歌声清脆悠扬，像是在诉说一段人间悲剧。{<br>}过了会，小鸟口出人言：「谢谢你听我唱歌。」{<br>}你感觉今晚会做个好梦。"],["转身离去","伯奇","你转身离去，隐约能听到清脆悠扬的歌声，像是在诉说一段人间悲剧。"]],""],
["选项","豆狸的酒宴","一群狸猫围着火堆​跳舞，它们见到你也不惊慌，继续着它们的舞蹈。{<br>}你走近几步，正要开口，一只狸猫先对你招了招手：{<br>}「别急，马上就好，先去那边稍等片刻吧。」{<br>}这时你才注意到，旁边有一个亭子，摆着许多酒坛。{<br>}你在亭子里坐下，等着将要发生的事，心中难免有些不安。{<br>}「豆狸虽没什么妖力，寻美酒的本事倒是不错。」{<br>}不知何时，亭子里多了一位俊秀的美少年，他皮肤白皙，上衣微敞，随意的半躺着。像是自言自语，也像在与你搭话。{<br>}忽然天空下起细雨，却不见乌云，月亮照常挂在天上。{<br>}「成了，成了！」狸猫们欢呼着，一窝蜂的跑去争抢酒坛里的酒喝，很快就醉倒一片。{<br>}远处一个有些佝偻的身影，迈着悠然的步伐，如闲庭信步般悄悄接近，走近了才看清，是一位衣着名贵的光头老者。{<br>}「抱歉抱歉，来晚了。」老人说着抱歉，却丝毫没有道歉的意思，反而带着一抹似有似无的笑意。{<br>}他自顾自的在亭子里找了个位置坐下，笑了笑：「我自罚三杯。」{<br>}美少年抬了抬眉，目光有些不善：「这个酒宴没有邀请你。」{<br>}老头泰然自若的回敬：「但，也没有邀请你。」{<br>}美少年瞥了老头一眼，冷笑道：「这天下的美酒本王想喝就喝，不需要邀请。」{<br>}你忽闻一股烟味。回头望去，原先热烈跳动的火焰此刻变得无精打采，光芒黯淡。{<br>}一缕青烟袅袅升起，如纱一般轻盈，飘进亭子，缭绕片刻后又忽然消散。一片朦胧间，竟走出了一位身姿婀娜、尽显魅惑的美女。{<br>}她款步走到你身旁，轻轻拍了拍你的肩膀，妩媚一笑：「不用理他们，先和姐姐喝一杯吧。」{<br><br>}你的面前摆着几样美酒，你的选择是？",[["八百八狸梅子酒","八百八狸梅子酒","新鲜梅子的果香，又有一分猛烈。{<br>}不一会，你在一片弥漫的酒香中，渐渐进入了梦乡。{<br><br><span class='mohumu'>豆狸酿造的果酒，纪念狸猫一族有名的老大八百八狸。</span>}"],["六条般若汤","六条般若汤","一口入喉，嫉妒、愤恨、不甘随着酒液流通全身。{<br>}不一会，你在一片弥漫的酒香中，渐渐进入了梦乡。{<br><br><span class='mohumu'>酒吞童子带来的酒，六条是光源氏的情人之姓，般若汤是僧人对酒的隐语。</span>}"],["辉夜御神酒","辉夜御神酒","淡淡竹香，轻软绵柔，宛若月宫降下的甘露。{<br>}不一会，你在一片弥漫的酒香中，渐渐进入了梦乡。{<br><br><span class='mohumu'>滑瓢带来的酒，御神酒是一种常用于祭祀、婚礼等活动的酒，也许是滑瓢在哪里顺出来的？</span>}"],["蜃气酒","蜃气酒","虚无缥缈，如梦如幻。{<br>}不一会，你在一片弥漫的酒香中，渐渐进入了梦乡。{<br><br><span class='mohumu'>烟烟罗带来的酒，蜃气是一种虚无缥缈的妖怪，就像烟烟罗一样。</span>}"]],"熄灭的篝火，一片狼藉的空酒坛，这里似乎曾有过一场热闹的狂欢。"],
["选项","葛巾紫","你来到一片长着紫色和白色牡丹花的地方，一男子落寞的坐在那里赏花，手中端着一碗接好的露水。{<br>}你问他这是在做什么。{<br>}他想了想，答：「这是我娘子调的毒，你若想喝就送你一碗。」",[["喝","葛巾紫","药味又凉又香，不像是毒药。{<br>}一会儿，觉得胸中宽松舒畅，头脑清爽。"],["不喝","葛巾紫","你觉得这就是一个疯子，没有理他。"]],""],
["选项","火？","途径墓地，你看到不远处有火光闪烁。",[["驻足观察","鬼火","你站在原地观察，鬼火忽明忽暗，不一会就消失不见了。"],["走过去","鬼火","你向着火光走去，鬼火仿佛怕你似的纷纷躲避，不一会就消失不见了。"],["视而不见的离开此地","鬼火","你快步离开这里，鬼火却在身后跟了上来，你走的越快它们也越快，你越慢它们也慢。{<br>}终于走出墓地，它们没有跟过来了。"]],""],
["选项","火？","你看到不远处有火光闪烁。",[["驻足观察","狐火","你看到仿佛星星在黑暗中嬉戏，跳跃，绽放。{<br>}你看的入迷，不知过了多久才回过神，四周漆黑一片，根本没有什么星星。{<br>}但你总觉得自己失去了什么。"],["走过去","狐火","你向着火光走去，你看到草地上是一群妖狐在玩闹，不时从口中吐出火焰。{<br>}它们发现了你，一团火球向你飞来，你躲闪不及被砸个正着，却没觉得痛。{<br>}回过神来，四周漆黑一片，什么都没有。"],["视而不见的离开此地","狐火","你快步离开了这里，什么都没有发生。"]],""],
["特殊","应声虫"],
["特殊","血月"],
];
let 特殊={};
let 执行={
"应声虫":()=>{当前=["应声虫"];特殊["应声虫"]=7;d.splice(随机数,1);输入("你终于遇到一个行人，他好心提醒你：「天黑了，天黑了，快些回家吧，快些回家吧。」");},
"执行_应声虫":(a,b)=>{document.getElementById("按钮").innerHTML="<br><a onclick='"+a+"()'>"+b+"，"+b+"</a>";特殊["应声虫"]-=1;},
"血月":()=>{
    if(!特殊["血月"]||特殊["血月"]&&特殊["血月"]==0){特殊["血月"]=1}else{特殊["血月"]+=1}
    当前=["特殊","血月"];
    标题=t["血月"+特殊["血月"]][0];
    输入(t["血月"+特殊["血月"]][1]);
    if(特殊["血月"]==3){
    document.getElementById("按钮").innerHTML="<br><a onclick='下一页()'>继续赶路……？</a>";
    }else if(特殊["血月"]==4){
    document.getElementById("按钮").innerHTML="<br><a onclick='下一页()'>继续赶路……吧</a>";
    d.splice(随机数,1);
    }else{
    document.getElementById("按钮").innerHTML="<br><a onclick='下一页()'>继续赶路</a>";
    }
},
"涂壁":()=>{标题="涂壁";输入("你被一面巨大的墙壁挡住去路，高耸入云，左右都望不到尽头。{<br>}正当你一筹莫展之时，墙壁发出一阵闷沉而巨大的声响，它向你提问：「何物越洗越脏？」{<br><br><input id='涂壁回答' type='text' placeholder='你的回答' autocomplete='off'>　<a onclick=\"执行['执行_涂壁']()\">你如此回答</a>。"+((特殊["涂壁"])?"<br><small>答案：<span class='mohumu'>水</span></small>":"")+"}")},
"执行_涂壁":()=>{
let 临时=document.getElementById("涂壁回答").value;
if(临时=="水"||临时.indexOf("水")!=-1){
    d.splice(随机数,1);
    输入("忽然墙壁消失不见，仿佛从未存在。");document.getElementById("按钮").innerHTML="<br><a onclick='下一页()'>继续赶路</a>";
}else if(临时=="人心"||临时.indexOf("人心")!=-1||临时.indexOf("的心")!=-1){
    d.splice(随机数,1);
    输入("忽然墙壁碎裂崩塌，露出内部的累累尸骨。");
    document.getElementById("按钮").innerHTML="<br><a onclick='下一页()'>继续赶路</a>";
}else if(临时.indexOf("打")!=-1||临时.indexOf("敲")!=-1){
    d.splice(随机数,1);
    输入("你捡起路边的树枝敲打在墙壁上，看似坚不可摧的墙壁忽然破碎崩塌。");
    document.getElementById("按钮").innerHTML="<br><a onclick='下一页()'>继续赶路</a>";
}else{
    输入("墙壁一动不动，再也没发出什么声音。{<br>}你只好走了很远的路，终于绕开了墙壁。");
    document.getElementById("按钮").innerHTML="<br><a onclick='下一页()'>继续赶路</a>";
    特殊["涂壁"]=1;
}
},
// "测试":()=>{console.log("测试")},

};

let ing=0,标题="夜路归途";
async function 输入(content){
if(标题!=document.getElementById("标题").innerHTML){
    document.getElementById("标题").innerHTML=标题;
    document.getElementById("标题").style="opacity:0;";
}
document.getElementById("剩余").innerHTML="/"+d.length;
ing=1;
const output=document.getElementById('output');
output.innerHTML='';
const parts=content.split(/(\{[^}]+\})/).filter(part=>part!=='');

for(const part of parts){
if(part.startsWith('{')&&part.endsWith('}')){
output.insertAdjacentHTML('beforeend',part.slice(1,-1));
}else{await typeCharacters(part,output);}}
ing=0;
结束();
}

async function typeCharacters(text,element){
const textNode=document.createTextNode('');
element.appendChild(textNode);

for(const char of text){
await new Promise(resolve=>setTimeout(resolve,速度));
textNode.data+=char;
}
}

function 结束(){
document.getElementById("标题").style="animation:biaoti 9s forwards";
if(特殊["血月"]&&特殊["血月"]!=0&&当前[1]!="血月"){特殊["血月"]=0;}
if(当前[0]=="特殊"){
}else if(当前[0]=="选项"){
if(当前[3].length<1){
if(特殊["应声虫"]&&特殊["应声虫"]>0){执行["执行_应声虫"]("下一页","继续赶路");return;}
document.getElementById("按钮").innerHTML="<br><a onclick='下一页()'>继续赶路</a>";
}else{
let 临时="<br>";
for(let i=0;当前[3].length>i;i++){
临时+="<a onclick='继续("+i+")'>"+当前[3][i][0]+"</a><br>";
}
if(当前[5]){}else{d[随机数][5]=""}
临时+=d[随机数][5];
document.getElementById("按钮").innerHTML=临时;
}

}else if(当前[0]=="继续"){
if(特殊["应声虫"]&&特殊["应声虫"]>0){执行["执行_应声虫"]("下一页","继续赶路");return;}
document.getElementById("按钮").innerHTML="<br><a onclick='下一页()'>继续赶路</a>";
}else if(当前[0]=="结局"){
}else{
if(特殊["应声虫"]&&特殊["应声虫"]>0){执行["执行_应声虫"]("下一页","继续赶路");return;}
document.getElementById("按钮").innerHTML="<br><a onclick='下一页()'>继续赶路</a>";
}
}

function 直接显示(o){
    if(标题!=document.getElementById("标题").innerHTML){
        document.getElementById("标题").innerHTML=标题;
        document.getElementById("标题").style="opacity:0;";
    }
    document.getElementById("剩余").innerHTML="/"+d.length;
    document.getElementById("output").innerHTML=o.replace(new RegExp('\{',"g"),"").replace(new RegExp('\}',"g"),"");
    结束();
}

let 随机数;
let 当前=t["开始"];
function 下一页(){
    if(ing==1)return;
    document.getElementById("按钮").innerHTML="";

    if(d.length<1){
        当前=t["结局"];
        标题=当前[0];
        输入(当前[1]);
        document.getElementById("按钮").innerHTML="";
        return;
    }

    随机数=Math.floor(Math.random()*d.length);
    当前=d[随机数].slice();
    if(当前[0]=="特殊"){
        执行[当前[1]]();
    }else if(当前[0]=="选项"){
        标题=当前[1];
        if(当前[3].length<1){
            d.splice(随机数,1);
            当前[0]="继续";
            if(当前[5]){直接显示(当前[4]);}else{输入(当前[4]);}
        }else{
            if(当前[5]){直接显示(当前[2]);}else{输入(当前[2]);}
        }
    }else if(当前[0]=="进展"){
        if(当前.length==2){d.splice(随机数,1);}
        else{d[随机数].splice(1,1);}
        标题=当前[1][0];
        输入(当前[1][1]);
    }else{
        d.splice(随机数,1);
        标题=当前[0];
        输入(当前[1]);
    }
}
function 继续(o){
    if(ing==1)return;
    document.getElementById("按钮").innerHTML="";
    当前[0]="继续";
    标题=当前[3][o][1];
    输入(当前[3][o][2]);
    if(d[随机数][5]!=""){d[随机数][5]+="<br>"}
    d[随机数][5]+="<del><a>"+d[随机数][3][o][0]+"</a></del>";
    d[随机数][3].splice(o,1);
    if(d[随机数][3].length<1&&d[随机数][4]==""){d.splice(随机数,1);}
}

输入(当前[1])